/** @file
  String definitions for Sio Configuration form.

;******************************************************************************
;* Copyright (c) 2013, Insyde Software Corporation. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

#langdef en-US "en-USlish"
#langdef fr-FR "fr-FRncais"

//
// HardwareMonitor Menu
//
#string STR_EFI_SETUP_UTILITY_TITLE             #language en-US         "STR_EFI_SETUP_UTILITY_TITLE"
#string STR_HARDWARE_MONITOR_TITLE              #language en-US         "Hardware Monitor"
#string STR_HARDWARE_MONITOR_HELP               #language en-US         ""
#string STR_HARDWARE_MONITOR_TITLE_VOLTAGE      #language en-US         "Voltage"
#string STR_HARDWARE_MONITOR_TITLE_TEMPERATURE  #language en-US         "Temperature"
#string STR_HARDWARE_MONITOR_TITLE_FANSPEED     #language en-US         "Fan Speed"
#string STR_HARDWARE_MONITOR_VIN0_STRING        #language en-US         "  VIN0 (V)"
#string STR_HARDWARE_MONITOR_VIN0_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VIN1_STRING        #language en-US         "  VIN1 (V)"
#string STR_HARDWARE_MONITOR_VIN1_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VIN2_STRING        #language en-US         "  VIN2 (V)"
#string STR_HARDWARE_MONITOR_VIN2_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VIN3_STRING        #language en-US         "  VIN3 (V)"
#string STR_HARDWARE_MONITOR_VIN3_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VIN4_STRING        #language en-US         "  VIN4 (V)"
#string STR_HARDWARE_MONITOR_VIN4_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VIN5_STRING        #language en-US         "  VIN5 (V)"
#string STR_HARDWARE_MONITOR_VIN5_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VIN6_STRING        #language en-US         "  VIN6 (V)"
#string STR_HARDWARE_MONITOR_VIN6_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VIN7_STRING        #language en-US         "  VIN7 (V)"
#string STR_HARDWARE_MONITOR_VIN7_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_12V_STRING         #language en-US         "  +12V"
#string STR_HARDWARE_MONITOR_12V_HELP           #language en-US         ""
#string STR_HARDWARE_MONITOR_N12V_STRING        #language en-US         "  -12V"
#string STR_HARDWARE_MONITOR_N12V_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VCC_STRING         #language en-US         "  VCC (V)"
#string STR_HARDWARE_MONITOR_VCC_HELP           #language en-US         ""
#string STR_HARDWARE_MONITOR_VSB_STRING         #language en-US         "  VASB (V)"
#string STR_HARDWARE_MONITOR_VSB_HELP           #language en-US         ""
#string STR_HARDWARE_MONITOR_VBAT_STRING        #language en-US         "  VBAT"
#string STR_HARDWARE_MONITOR_VBAT_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VCORE_STRING       #language en-US         "  VCORE"
#string STR_HARDWARE_MONITOR_VCORE_HELP         #language en-US         ""
#string STR_HARDWARE_MONITOR_AVCC_STRING        #language en-US         "  VCC3"
#string STR_HARDWARE_MONITOR_AVCC_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_VDIMM_STRING       #language en-US         "  VDIMM"
#string STR_HARDWARE_MONITOR_VDIMM_HELP         #language en-US         ""
#string STR_HARDWARE_MONITOR_VLDT_STRING        #language en-US         "  VLDT"
#string STR_HARDWARE_MONITOR_VLDT_HELP          #language en-US         ""
#string STR_HARDWARE_MONITOR_5V_STRING         #language en-US          "  5V"
#string STR_HARDWARE_MONITOR_5V_HELP           #language en-US          ""

#string STR_HARDWARE_MONITOR_CPU_FAN_STRING     #language en-US         "  CPU FAN"
#string STR_HARDWARE_MONITOR_CPU_FAN_HELP       #language en-US         ""
#string STR_HARDWARE_MONITOR_SYS_FAN_STRING     #language en-US         "  SYS FAN"
#string STR_HARDWARE_MONITOR_SYS_FAN_HELP       #language en-US         ""
#string STR_HARDWARE_MONITOR_AUX_FAN_STRING     #language en-US         "  AUX FAN"
#string STR_HARDWARE_MONITOR_AUX_FAN_HELP       #language en-US         ""

#string STR_HARDWARE_MONITOR_SYS_TEMP1_STRING   #language en-US         "  System (°C/°F)"
#string STR_HARDWARE_MONITOR_SYS_TEMP1_HELP     #language en-US         ""
#string STR_HARDWARE_MONITOR_CPU_TEMP_STRING    #language en-US         "  CPU (°C/°F)"
#string STR_HARDWARE_MONITOR_CPU_TEMP_HELP      #language en-US         ""
#string STR_HARDWARE_MONITOR_AUX_TEMP_STRING    #language en-US         "  AUX1 (°C/°F)"
#string STR_HARDWARE_MONITOR_AUX_TEMP_HELP      #language en-US         ""
#string STR_HARDWARE_MONITOR_DDR_TEMP_STRING    #language en-US         "  AUX1 (°C/°F)"
#string STR_HARDWARE_MONITOR_DDR_TEMP_HELP      #language en-US         ""
#string STR_HARDWARE_MONITOR_SYS_TEMP2_STRING   #language en-US         "  AUX2 (°C/°F)"
#string STR_HARDWARE_MONITOR_SYS_TEMP2_HELP     #language en-US         ""

#string STR_CPU_COOLING_FAN_CTRL_STRING         #language en-US         "CPU Cooling Fan Control"
#string STR_FAN_CTRL_STRING                     #language en-US         "Fan Control Mode"
#string STR_FAN_CTRL_HELP                       #language en-US         ""
#string STR_CPU_SHUTDOWN_TEMPERATURE_STRING     #language en-US         "CPU Shutdown Temperature"
#string STR_CPU_SHUTDOWN_TEMPERATURE_HELP       #language en-US         ""
#string STR_CPU_WARNING_TEMPERATURE_STRING      #language en-US         "CPU Warning Temperature"
#string STR_CPU_WARNING_TEMPERATURE_HELP        #language en-US         ""
#string STR_KEEP_MIN_FAN_OUTPUT_VALUE_STRING    #language en-US         "Trun off Fan when Low Temperature"
#string STR_KEEP_MIN_FAN_OUTPUT_VALUE_HELP      #language en-US         ""
#string STR_MANUAL_TEXT                         #language en-US         "Manual Mode"
#string STR_THERMAL_TEXT                        #language en-US         "Thermal Cruise Mode"
#string STR_SPEED_TEXT                          #language en-US         "Speed Cruise Mode"
#string STR_SMART_FAN_TEXT                      #language en-US         "Smart Fan IV"

#string STR_TOLERANCE_VALUE_STRING              #language en-US         "  Tolerance Value (°C)"
#string STR_TOLERANCE_VALUE_HELP                #language en-US         ""
#string STR_TARGET_TEMPERATURE_STRING           #language en-US         "  Target Temperature"
#string STR_TARGET_TEMPERATURE_HELP             #language en-US         ""
#string STR_TARGET_SPEED_COUNT_STRING           #language en-US         "  Target Speed Count"
#string STR_TARGET_SPEED_COUNT_HELP             #language en-US         ""
